{"Research Assistant": "Hello Professor {name}, \n\nI hope you are doing well. I am writing to express my interest in your work on ______. I am currently a first-year computer science and biology major at Northeastern University. I have taken Discrete Structures and other computer science classes in the past. I am taking Fundamentals of CS, General Biology, and General Chemistry. I came across your lab, ______, while searching for research opportunities on campus. I would like to assist in your work in the long term as a student with prior coding experience and a drive to learn. I am eager to gain a foothold in a long-term research project. Attached to this email is my resume. If you have an opening within your lab, please feel free to reach out! I look forward to hearing from you. \n\nBest, Jaydon\n", "Letter of Recommendation": "\n        Hi Professor {name},\n\n        I hope this email finds you well. I am reaching out to kindly request a letter of recommendation from you. \n        Your guidance and mentorship during [specific course or project] have been invaluable, and I believe your recommendation would greatly strengthen my application for [specific program or opportunity].\n\n        Please let me know if you would be willing to assist me with this. I would be happy to provide any additional information or materials you may need.\n\n        Thank you for your time and support.\n\n        Best regards,\n        [Your Name]\n        ", "Teaching Assistant": "\n        Dear Professor {name},\n\n        I hope this email finds you well. I am writing to express my interest in serving as a Teaching Assistant for your course, [specific course name]. \n        Having excelled in this course and gained a strong understanding of the material, I am confident in my ability to assist students effectively.\n\n        I would greatly appreciate the opportunity to discuss this role further. Please let me know if there is a convenient time to meet.\n\n        Thank you for your time and consideration.\n\n        Best regards,\n        [Your Name]\n        "}